"""
Задачи"Магические методы"
1. Для класса Task добавить строковое отображение в следующем виде:
Название задачи, Статус выполнения: Ожидает старта, Дата создания: 01.04.2024
В геттере списка задач в классе User используйте строковое представление для задачи

2. Для класса User добавить строковое отображение в следующем виде:
Фамилия имя, Email: example@example.com, Всего задач в списке: 5

3. Для класса Task добавьте новое поле - плановое время выполнения в минутах.
Реализуйте логику сложения экземпляров класса Task. Результатом сложения будет
суммарная длительность выполнения задач в минутах (целым числом)

4. Создайте новый вспомогательный класс, с помощью которого можно перебирать задачи одного пользователя,
например, в цикле for. Для этого новый класс должен принимать на вход объект класса User и производить
итерацию по задачам, которые есть у данного пользователя.
То есть метод выполнения следующего шага итерации должен возвращать очередную задачу из списка задач пользователя.

5. Напишите тесты на новый функционал
"""

